AioCMS/src/Catalogs/Сообщества/Сообщества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сообщества</name>
  <predefined>
    <items>
      <name>Athenaeum</name>
      <description>Two- Digit Athenaeum</description>
    </items>
    <items>
      <name>Тест</name>
      <description>Тест</description>
    </items>
  </predefined>
  <attributes>
    <name>ВК_ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_V</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_group_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_owner_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_access_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitysecret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_communitytoken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>220</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_chat_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СсылкаVK</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>TGB_token</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDАльбома</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПостовВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКомпании</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_Кабинет</name>
    <type>
      <types>CatalogRef.РекламныеКабинеты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_ДневнойЛимитНаЗапись</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_НомерКатегории</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоОбъявлений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтандартныйУровеньПоста</name>
    <type>
      <types>EnumRef.УровниПостов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСообщества</name>
    <type>
      <types>EnumRef.ТипыСообществ</types>
    </type>
  </attributes>
  <attributes>
    <name>РаскруткаБотами</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лого</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСложноПосты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодичностьСложнопостов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СобиратьСтатистику</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВК_bot_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТГ_КаналАрхив</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Объявления</name>
    <attributes>
      <name>ID</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОбновления</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

AioCMS/src/CommonModules/МетодыРаботыTelegram/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Отправить картинку.
// 
// Параметры:
//  Сообщество - СправочникСсылка.Сообщества - Сообщество
//  Текст - Строка - Текст
//  Картинка - ДвоичныеДанные -Картинка
// 
// Возвращаемое значение:
//  Произвольный -  Ответ Telegram
Функция ОтправитьКартинку(Знач Сообщество, Знач Текст, Знач Картинка) Экспорт
    
    РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ТГ_token,ТГ_chat_id");
    
    Параметры = Новый Структура;
    Параметры.Вставить("caption"            , Текст); 
    Параметры.Вставить("protect_content"    , "true");
    Параметры.Вставить("token"              , РеквизитыСообщества.ТГ_token);
    Параметры.Вставить("chat_id"            , РеквизитыСообщества.ТГ_chat_id);
    
    СтруктураФайлов = Новый Структура;
    СтруктураФайлов.Вставить("photo",  Картинка);
    
    Ответ = МетодыРаботыHttp.Post("https://api.telegram.org/bot" + Параметры.token + "/sendPhoto"
        , Параметры
        , СтруктураФайлов); 

    Возврат Ответ;
    
КонецФункции

// Отправить группу картинок.
// 
// Параметры:
//  Сообщество - СправочникСсылка.Сообщества - Сообщество
//  Текст - Строка - Текст
//  МассивКартинок - Массив из ДвоичныеДанные - Массив картинок
// 
// Возвращаемое значение:
//  Произвольный -  Отправить группу картинок
Функция ОтправитьГруппуКартинок(Знач Сообщество, Знач Текст, Знач МассивКартинок) Экспорт
    
    РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ТГ_token,ТГ_chat_id");
    
    Параметры    = Новый Структура;
    photo        = "photo";
    
    Параметры.Вставить("protect_content", "true");
    Параметры.Вставить("token"          , РеквизитыСообщества.ТГ_token);
    Параметры.Вставить("chat_id"        , РеквизитыСообщества.ТГ_chat_id);

    Медиа             = Новый Массив;    
    СтруктураФайлов   = Новый Структура;
    Счетчик           = 0;
    
    Для Каждого КартинкаМассива Из МассивКартинок Цикл
        
        ФайлСуществует = Ложь;
        
        Если ТипЗнч(КартинкаМассива) = Тип("Строка") Тогда
            ФайлПути        = Новый Файл(КартинкаМассива);
            ФайлСуществует  = ФайлПути.Существует();
        Иначе
            ФайлСуществует  = Истина;
        КонецЕсли;

        Если ФайлСуществует Тогда
            
            СтруктураФайлов.Вставить(photo + Строка(Счетчик),  КартинкаМассива);
            
            СтруктураМедиа = Новый Структура;
            СтруктураМедиа.Вставить("type"    , photo);
            СтруктураМедиа.Вставить("media"   , "attach://" + photo + Строка(Счетчик));
            
            Если Счетчик = 0 Тогда
                СтруктураМедиа.Вставить("caption", Текст);
            КонецЕсли;
            
            Медиа.Добавить(СтруктураМедиа);
            
            Счетчик = Счетчик + 1;
            
        КонецЕсли;
                
    КонецЦикла;

    Параметры.Вставить("media", МетодыРаботыHttp.JSONСтрокой(Медиа));
    
    Ответ = МетодыРаботыHttp.Post("https://api.telegram.org/bot" + Параметры.token + "/sendMediaGroup"
        , Параметры
        , СтруктураФайлов); 

    Возврат Ответ;

КонецФункции

// Отправить сообщение.
// 
// Параметры:
//  IDЧата - Число,Строка - ID чата Telegram
//  Текст - Строка - Текст
//  Клавиатура - Строка -  Клавиатура в формате JSON
// 
// Возвращаемое значение:
//  Произвольный -  Отправить сообщение
Функция ОтправитьСообщение(Знач IDЧата, Знач Текст, Знач Клавиатура = "") Экспорт
    
    МетодыРаботыHttp.ЗаменитьСпецсимволы(Текст);
    IDЧата = МетодыРаботыHttp.ЧислоВСтроку(IDЧата);
    Токен  = ИнструментарийВызовСервера.ЗначениеРеквизитаОбъекта(Справочники.Сообщества.Athenaeum, "TGB_token"); 

    Если Не ЗначениеЗаполнено(Клавиатура) Тогда
       
        Строки = Новый Массив;
        Кнопки = Новый Массив;
        
        Кнопки.Добавить(Новый Структура("text,callback_data", "<-"    , "<-"));
        Кнопки.Добавить(Новый Структура("text,callback_data", "->"    , "->"));
        
        Строки.Добавить(Кнопки);
        
        ЗаписьJSON    = Новый ЗаписьJSON;
        ПЗJSON        = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, , , ЭкранированиеСимволовJSON.СимволыВнеASCII);
        ЗаписьJSON.УстановитьСтроку(ПЗJSON);
            
        ЗаписатьJSON(ЗаписьJSON, Новый Структура("keyboard,resize_keyboard", Строки, Истина));
        
        Клавиатура = ЗаписьJSON.Закрыть();
    
    КонецЕсли;
    
    _Параметры = Новый Структура;
    _Параметры.Вставить("parse_mode"    , "Markdown");
    _Параметры.Вставить("text"          , Текст);
    _Параметры.Вставить("chat_id"       , IDЧата);
    _Параметры.Вставить("reply_markup"  , Клавиатура);
    
    Ответ = МетодыРаботыHttp.Get("api.telegram.org/bot" + Токен + "/sendMessage", _Параметры);
            
    Возврат Ответ;
    
КонецФункции

// Сформировать клавиатуру по массиву кнопок.
// 
// Параметры:
//  МассивКнопок - Массив из Строка - Массив названий = значений кнопок
//  ПодСообщением - Булево -  Под сообщением или как панель
// 
// Возвращаемое значение:
//  Строка -  JSON
Функция СформироватьКлавиатуруПоМассивуКнопок(Знач МассивКнопок, Знач ПодСообщением = Ложь) Экспорт
    
    Строки = Новый Массив;
        
    Для Каждого Кнопка Из МассивКнопок Цикл
        
        Кнопки = Новый Массив;
        Кнопка = КодироватьСтроку(МетодыРаботыHttp.ЧислоВСтроку(Кнопка), СпособКодированияСтроки.КодировкаURL);
        Кнопки.Добавить(Новый Структура("text,callback_data", Кнопка, Кнопка));
        Строки.Добавить(Кнопки);

    КонецЦикла;
    
    Если ПодСообщением Тогда
        СтруктураПараметра = Новый Структура("inline_keyboard,rows", Строки, 1);
    Иначе
        СтруктураПараметра = Новый Структура("keyboard,resize_keyboard", Строки, Истина);
    КонецЕсли;
        
    ЗаписьJSON    = Новый ЗаписьJSON;
    ПЗJSON        = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, , , ЭкранированиеСимволовJSON.СимволыВнеASCII);
    ЗаписьJSON.УстановитьСтроку(ПЗJSON);
        
    ЗаписатьJSON(ЗаписьJSON, СтруктураПараметра);
    
    Возврат ЗаписьJSON.Закрыть();
    
КонецФункции

Функция ОтправитьАудио(Знач Сообщество, Знач Аудио, Знач Текст = "", Знач Клавиатура = "") Экспорт
	
	РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество, "ТГ_token,ТГ_chat_id");
	Токен				= РеквизитыСообщества.ТГ_token;
	IDЧата				= РеквизитыСообщества.ТГ_chat_id;
	
    Возврат ОтправитьФайл(Токен, IDЧата, Текст, Аудио, "audio", Клавиатура);
    
КонецФункции

Функция ОтправитьФайл(Знач Токен, Знач IDЧата, Знач Текст, Знач Файл, Знач Вид, Знач Клавиатура) Экспорт
    
    Если Вид = "photo" Тогда
        Метод = "/sendPhoto";
    ИначеЕсли Вид = "video" Тогда
        Метод = "/sendVideo";
    ИначеЕсли Вид = "audio" Тогда
        Метод = "/sendAudio";
    ИначеЕсли Вид = "document" Тогда
        Метод   = "/sendDocument";
    ИначеЕсли Вид = "animation" Тогда
        Метод = "/sendAnimation";
    Иначе 
        Возврат "";
    КонецЕсли;
    
    МетодыРаботыHttp.ЗаменитьСпецСимволы(Текст);
    IDЧата = МетодыРаботыHttp.ЧислоВСтроку(IDЧата);
    
    Если Не ТипЗнч(Файл) = Тип("ДвоичныеДанные") Тогда      
        ТекущийФайл = Новый Файл(Файл);
        Расширение  = ?(Вид = "document", ТекущийФайл.Расширение, "");
        Файл        = Новый ДвоичныеДанные(Файл);   
    Иначе
        Расширение  = "";
    КонецЕсли;
    
    Расширение = СтрЗаменить(Расширение, ".", "___");
    
    _Параметры = Новый Структура;
    _Параметры.Вставить("parse_mode"    , "Markdown");
    _Параметры.Вставить("caption"       , Текст);
    _Параметры.Вставить("chat_id"       , IDЧата);
    _Параметры.Вставить("reply_markup"  , Клавиатура);
    
    СтруктураФайлов = Новый Структура;
    СтруктураФайлов.Вставить(Вид + Расширение,  Файл);
    
    Ответ = МетодыРаботыHttp.Post("api.telegram.org/bot" 
    + Токен 
    + Метод, _Параметры, СтруктураФайлов, "mixed"); 
   
    Возврат Ответ;
    
КонецФункции

Функция ПереслатьСообщение(Знач Сообщество, Знач IDОригинала) Экспорт
	
	РеквизитыСообщества = ИнструментарийВызовСервера.ЗначенияРеквизитовОбъекта(Сообщество
	   , "ТГ_token,ТГ_chat_id,ТГ_КаналАрхив");
	   
	IDОригинала			= МетодыРаботыHttp.ЧислоВСтроку(IDОригинала);
	Токен				= РеквизитыСообщества.ТГ_token;
	КудаID				= РеквизитыСообщества.ТГ_chat_id;
	ОткудаID			= РеквизитыСообщества.ТГ_КаналАрхив;

    _Параметры = Новый Структура;
    _Параметры.Вставить("chat_id"       , КудаID);
    _Параметры.Вставить("from_chat_id"  , ОткудаID);
    _Параметры.Вставить("message_id"    , IDОригинала);
    
    Ответ = МетодыРаботыHttp.Get("api.telegram.org/bot" + Токен + "/forwardMessage", _Параметры);
    
    Возврат Ответ;

КонецФункции

#КонецОбласти
